## This ipynb will just walk through the basics. I encourage you to tweak things around because I have left it incomplete enough for you to be curious. 
## Go ahead. Play with it.

In [22]:
# import statements. Notice that pandas is built on top of numpy arrays
import pandas as pd
from pandas import np

In [23]:
# Creating dataframes
# There are a lot of methods of creating a dataframe
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Jacobson', '.', 'Milner', 'Cooze'], 
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, None, None],
        'postTestScore': ["25,000", "94,000", 57, 62, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'preTestScore', 'postTestScore'])
df

  first_name last_name  age  preTestScore postTestScore
0      Jason    Miller   42           4.0        25,000
1      Molly  Jacobson   52          24.0        94,000
2       Tina         .   36          31.0            57
3       Jake    Milner   24           NaN            62
4        Amy     Cooze   73           NaN            70

In [24]:
# Task: Try creating a df from a list of list/ numpy array

In [ ]:
# saving the df as a csv
df.to_csv('sampleDF.csv',index=False,encoding='utf-8')

In [ ]:
# reading a csv as a pandas dataframe
df = pd.read_csv('sampleDF.csv')

In [25]:
# Printing the columns of the df
df.columns

Index([u'first_name', u'last_name', u'age', u'preTestScore', u'postTestScore'], dtype='object')

In [9]:
# To find the data types of each of the columns
df.dtypes

first_name        object
last_name         object
age                int64
preTestScore     float64
postTestScore     object
dtype: object

In [10]:
# retrieving a column
df['first_name']

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [11]:
# retrieving several columns in a particular order
df[['first_name','age']]

  first_name  age
0      Jason   42
1      Molly   52
2       Tina   36
3       Jake   24
4        Amy   73

In [27]:
# adding columns
df['alive'] = 1
df

  first_name last_name  age  preTestScore postTestScore  alive
0      Jason    Miller   42           4.0        25,000      1
1      Molly  Jacobson   52          24.0        94,000      1
2       Tina         .   36          31.0            57      1
3       Jake    Milner   24           NaN            62      1
4        Amy     Cooze   73           NaN            70      1

In [12]:
# First n records
df.head(3)

  first_name last_name  age  preTestScore postTestScore
0      Jason    Miller   42           4.0        25,000
1      Molly  Jacobson   52          24.0        94,000
2       Tina         .   36          31.0            57

In [13]:
# Last n records
df.tail(3)

  first_name last_name  age  preTestScore postTestScore
2       Tina         .   36          31.0            57
3       Jake    Milner   24           NaN            62
4        Amy     Cooze   73           NaN            70

In [14]:
# using values will return the np array
df.values

array([['Jason', 'Miller', 42, 4.0, '25,000'],
       ['Molly', 'Jacobson', 52, 24.0, '94,000'],
       ['Tina', '.', 36, 31.0, 57],
       ['Jake', 'Milner', 24, nan, 62],
       ['Amy', 'Cooze', 73, nan, 70]], dtype=object)

In [16]:
# using iloc allows you to access the records in pandas df format
df.iloc[1:3]

  first_name last_name  age  preTestScore postTestScore
1      Molly  Jacobson   52          24.0        94,000
2       Tina         .   36          31.0            57

In [17]:
# Pandas query
df[df.age>50]

  first_name last_name  age  preTestScore postTestScore
1      Molly  Jacobson   52          24.0        94,000
4        Amy     Cooze   73           NaN            70

In [19]:
# Pandas query with multiple arguments
df[(df.age<=50) & (df.postTestScore>40)]

  first_name last_name  age  preTestScore postTestScore
0      Jason    Miller   42           4.0        25,000
2       Tina         .   36          31.0            57
3       Jake    Milner   24           NaN            62

In [26]:
# sorting according to a particular column/ columns
df.sort_values(by=['age'],ascending=True)

  first_name last_name  age  preTestScore postTestScore
3       Jake    Milner   24           NaN            62
2       Tina         .   36          31.0            57
0      Jason    Miller   42           4.0        25,000
1      Molly  Jacobson   52          24.0        94,000
4        Amy     Cooze   73           NaN            70

# All the operations above return a dataframe. In order to make changes in it, you have store the return value/ overwrite the existing with the return value and proceed.

## There are a number of other basic operations in pandas dataframes. You can learn them on the go when there is a need. Extensively use stackoverflow

# For dealing with date-time in pandas (which is going to be the biggest advantage of pandas),take a look into the following link:
-    https://chrisalbon.com/python/data_wrangling/pandas_time_series_basics/